In [3]:
!conda list | grep pandas

pandas                    1.3.4            py39h743cdd8_0

In [7]:
import pandas as pd

In [11]:
df = pd.read_csv('/Users/hallucy/Desktop/Coding/VSC/Python/pandas/data/friend_list.csv')

In [12]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [25]:
df = pd.read_csv('/Users/hallucy/Desktop/Coding/VSC/Python/pandas/data/friend_list_no_head.csv', header=None, names=['name','age','job'])

In [26]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager